; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	infrared4 - mode
	thermograph3 - mode
	image7 - mode
	thermograph2 - mode
	spectrograph5 - mode
	thermograph6 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image0)
	(supports instrument2 image7)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph3)
	(supports instrument3 image7)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Phenomenon6 thermograph6)
	(have_image Phenomenon7 thermograph6)
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon8 thermograph6)
	(have_image Star9 thermograph6)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon11 image7)
	(have_image Phenomenon11 image0)
	(have_image Planet12 image7)
))

)

; plan
1. (turn_to satellite1 star4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star4)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 10
5. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 10
6. (take_image satellite1 phenomenon11 instrument2 image7)
   added: (have_image phenomenon11 image7)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 2 of 10
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
9. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 10
10. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 10
11. (take_image satellite0 phenomenon6 instrument0 thermograph6)
   added: (have_image phenomenon6 thermograph6)
   goals met: 3 of 10
12. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 10
13. (take_image satellite0 phenomenon7 instrument0 thermograph6)
   added: (have_image phenomenon7 thermograph6)
   goals met: 4 of 10
14. (turn_to satellite0 phenomenon8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
15. (take_image satellite0 phenomenon8 instrument0 thermograph6)
   added: (have_image phenomenon8 thermograph6)
   goals met: 5 of 10
16. (turn_to satellite0 star9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star9)
   goals met: 5 of 10
17. (take_image satellite0 star9 instrument0 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 6 of 10
18. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 10
19. (take_image satellite1 phenomenon10 instrument2 image0)
   added: (have_image phenomenon10 image0)
   goals met: 7 of 10
20. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 10
21. (take_image satellite1 phenomenon8 instrument2 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 8 of 10
22. (turn_to satellite1 planet12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet12)
   goals met: 8 of 10
23. (take_image satellite1 planet12 instrument2 image7)
   added: (have_image planet12 image7)
   goals met: 9 of 10
24. (turn_to satellite1 groundstation2 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation2)
   goals met: 10 of 10
